{
  "dialog1": {
    "cue": ["I want 4 servings for this recipe", "Turn this into 4 servings"],
    "response": "Adjusted recipe for 4 servings, now yielding 8 instead of 12 pancakes:<br><br>1 cup milk<br>2/3 cups pumpkin puree<br>1 large egg<br>1 1/3 tablespoons vegetable oil<br>1 1/3 tablespoons vinegar<br>1 1/3 cups all-purpose flour<br>2 tablespoons brown sugar<br>1 1/3 teaspoons baking powder<br>2/3 teaspoon baking soda<br>2/3 teaspoon ground allspice<br>2/3 teaspoon ground cinnamon<br>1/3 teaspoon ground ginger<br>1/3 teaspoon salt<br>Cooking spray<br><br>Your question touches on changing the recipe, do you want me to show the altered recipe for you on the screen?"
  },
  "dialog2": {
    "cue": ["How to substitute whole milk and sour cream?", "I don't have milk and sour cream"],
    "response": "You can substitute whole milk with coconut milk and sour cream with Greek yogurt. Here's the adjusted recipe:<br><br>Cooking spray<br>6 matzo sheets<br>8 large eggs<br>1 cup coconut milk<br>¾ cup white sugar<br>½ cup Greek yogurt<br>2 teaspoons vanilla extract<br>1 teaspoon ground cinnamon<br>¾ teaspoon kosher salt<br>¼ teaspoon ground nutmeg<br>¼ cup chopped golden raisins<br>¼ cup chopped dried apricots<br>¼ cup chopped dried apples<br><br>Here’s the modified preparation steps for the dish:<br><br>Lightly coat a 2-quart baking dish with cooking spray. Set aside.<br>Break matzo sheets into bite-sized pieces. Whisk together eggs, coconut milk, sugar, Greek yogurt, vanilla, cinnamon, salt, and nutmeg in a large bowl. Stir in raisins, apricots, apples, and matzo pieces. Transfer to the prepared baking dish, smoothing into an even layer. Cover with aluminum foil and transfer to a refrigerator to chill for 8 hours, or overnight.<br>Preheat the oven to 350 degrees F (175 degrees C). Remove baking dish from the refrigerator and uncover.<br>Bake in the preheated oven until puffed and set, 40 to 45 minutes. Remove from the oven and let sit at room temperature for at least 15 minutes.<br><br>The substitution may affect the nutritions of the dish. Here's an estimation of the changes in nutritional facts for the same dish (per serving):<br><br>Calories: Approximately 172 (from the coconut milk) + Approximately 220 (from the Greek yogurt) = Approximately 392 calories (slightly higher)<br>Fat: Approximately 48g (from the coconut milk) + Approximately 10g (from the Greek yogurt) = Approximately 58g (higher)<br>Carbohydrates: Approximately 6g (from the coconut milk) + Approximately 9g (from the Greek yogurt) = Approximately 15g (lower)<br>Protein: Approximately 5g (from the coconut milk) + Approximately 23g (from the Greek yogurt) = Approximately 28g (higher)<br><br>Your question touches on changing the recipe, do you want me to show the altered recipe for you on the screen?<br><br>"  
  },
  "dialog3": {
    "cue": ["Suggest some recipes with 3 limes, 500ml of milk, 3 eggs, and 500g of flour. That's all I have left.", "What can I make with 3 limes, some milk, and flour?"],
    "response": "Based on these ingredients, I suggest you whip up these dishes:<br><br><ul><li><a href=https://www.allrecipes.com/recipe/15880/key-lime-pie-vii/>Key Lime Pie</a></li><br><li><a href=https://www.allrecipes.com/recipe/223532/lime-bars/>Lime Bars</a></li><br><li><a href=https://www.allrecipes.com/recipe/150642/fresh-lime-curd/>Fresh Lime Curd</a></li></ul><br>These recipes may require more or fewer ingredients. You can click on the names of the dishes to get redirected to the recipe pages. Have fun cooking!"
  }
}
